# Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.

a_list = [7, 5, 3, 3, 2]
b = input('Введите число: ')
b = int(b)
print(a_list)

for elem in a_list:
    ind = a_list.index(elem)
    if b >= elem:
        a_list.insert(ind, b)
        break
    else:
        a_list.append(b)
        break
print(a_list)
